services/payment/tests/fixtures/stripe_payment_intent_sample.json

{
  "amount": 1000,
  "amount_capturable": 0,
  "amount_details": {
    "tip": {}
  },
  "amount_received": 1000,
  "application": null,
  "application_fee_amount": null,
  "automatic_payment_methods": {
    "allow_redirects": "always",
    "enabled": true
  },
  "canceled_at": null,
  "cancellation_reason": null,
  "capture_method": "automatic_async",
  "client_secret": "pi_FX_PI001_secret_REDACTED",
  "confirmation_method": "automatic",
  "created": 1777771201,
  "currency": "sgd",
  "customer": "cus_FX_CUS001",
  "customer_account": null,
  "description": null,
  "excluded_payment_method_types": null,
  "id": "pi_FX_PI001",
  "last_payment_error": null,
  "latest_charge": "ch_FX_CH001",
  "livemode": false,
  "managed_payments": {
    "enabled": false
  },
  "metadata": {},
  "next_action": null,
  "object": "payment_intent",
  "on_behalf_of": null,
  "payment_method": "pm_FX_PM001",
  "payment_method_configuration_details": {
    "id": "pmc_1TSo76J6V9NGq4GXji6OJf8a",
    "parent": null
  },
  "payment_method_options": {
    "card": {
      "installments": null,
      "mandate_options": null,
      "network": null,
      "request_three_d_secure": "automatic"
    },
    "link": {
      "persistent_token": null
    },
    "paynow": {}
  },
  "payment_method_types": [
    "card",
    "paynow",
    "link"
  ],
  "processing": null,
  "receipt_email": null,
  "review": null,
  "setup_future_usage": null,
  "shared_payment_granted_token": null,
  "shipping": null,
  "source": null,
  "statement_descriptor": null,
  "statement_descriptor_suffix": null,
  "status": "succeeded",
  "transfer_data": null,
  "transfer_group": null
}